# Test conditional expressions and boolean operations  
> Type [5 > 3: 1; 0].
1
> Type [2 > 5: 1; 0].
0
> Set x = 10.
> Type [x > 5: x * 2; x / 2].
20
> Set x = 3.
> Type [x > 5: x * 2; x / 2].
1.5
> Set y = 15.
> Type [y < 10: 1; y < 20: 2; 3].
2
> Set y = 5.
> Type [y < 10: 1; y < 20: 2; 3].
1
> Set y = 25.
> Type [y < 10: 1; y < 20: 2; 3].
3
> Set a = 0.
> Set b = 0.
> Type [a = 0: [b = 0: 100; 200]; 300].
100
> Set b = 1.
> Type [a = 0: [b = 0: 100; 200]; 300].
200
> Set a = 1.
> Type [a = 0: [b = 0: 100; 200]; 300].
300